## 데이터분석과 시각화 중간고사 풀이(3분반)

20226744학번 박제현

10월 26일 강의

In [1]:
age_tuple = (23, 21, 24, 22, 20)
age_list = [23, 21, 24, 22, 20]
name_list = ['Kim', 'Lee', 'Park', 'Jung', 'Choi']
weight_list = [46, 53, 55, 49, 60]
height_list = [160, 162, 170, 158, 164]

In [2]:
#1. age_tuple에 대하여 다음과 같이 코딩한 경우 Error가 발생하는 것은 무엇인가요?
type(age_tuple)
#age_tuple.pop(2)
age_tuple.index(22)
sum(age_tuple)

110

In [3]:
# 2. age_tuple[-2] + age_tuple[2]으로 코딩한 경우 결과는?
age_tuple[-2] + age_tuple[2]

46

In [4]:
#3
name_list.remove('Park') 
#del name_list[2]
#name_list.pop(2)

In [5]:
#4
name_list.insert(4, 'Lim')
#name_list.append('Lim')
#name_list.extend(['Lim'])
name_list

['Kim', 'Lee', 'Jung', 'Choi', 'Lim']

In [6]:
#5
class_list = []
for age in age_tuple:
    for name in name_list:
        if age_tuple.index(age) == name_list.index(name):
            class_list.append((name, age))
class_list

[('Kim', 23), ('Lee', 21), ('Jung', 24), ('Choi', 22), ('Lim', 20)]

In [7]:
#6
class_list = []
for age in age_tuple:
    for name in name_list:
        if age_tuple.index(age) == name_list.index(name):
            class_list.append((name, age))
print('class_list =', class_list)

class_list = [('Kim', 23), ('Lee', 21), ('Jung', 24), ('Choi', 22), ('Lim', 20)]

In [8]:
#7
for student in class_list:
    for text in student:
        print(text)

Kim
23
Lee
21
Jung
24
Choi
22
Lim
20

In [9]:
#7-1
for student in class_list:
    print(len(student))
    print(type(student))
    for text in student:
        print(type(text))
print(len(class_list))

2
<class 'tuple'>
<class 'str'>
<class 'int'>
2
<class 'tuple'>
<class 'str'>
<class 'int'>
2
<class 'tuple'>
<class 'str'>
<class 'int'>
2
<class 'tuple'>
<class 'str'>
<class 'int'>
2
<class 'tuple'>
<class 'str'>
<class 'int'>
5

In [10]:
#8
class_dic = {}
for student in class_list:
    for j in range(1, len(student)):
        class_dic[student[0]] = student[1]
print('class_dic =', class_dic)

age_sum = 0
for key in class_dic:
    age_sum += class_dic[key]
print(age_sum)

class_dic = {'Kim': 23, 'Lee': 21, 'Jung': 24, 'Choi': 22, 'Lim': 20}
110

In [11]:
#9
import pandas as pd
ds1 = pd.Series(class_dic)
# ds1.clumns
ds1.shape
ds1.index
ds1.values
ds1

Kim     23
Lee     21
Jung    24
Choi    22
Lim     20
dtype: int64

In [12]:
#10
ds1[['Lee', 'Choi']]
ds1[[1, 3]]

Lee     21
Choi    22
dtype: int64

In [13]:
#11
dic = {'name': name_list, 'age': age_list, 'weight': weight_list, 'height': height_list}
import pandas as pd
df1 = pd.DataFrame(dic)
df2 = pd.DataFrame([age_list, weight_list, height_list], index = ['age', 'weight', 'height'], columns = name_list)
df2

        Kim  Lee  Jung  Choi  Lim
age      23   21    24    22   20
weight   46   53    55    49   60
height  160  162   170   158  164

In [14]:
df1.set_index('name', inplace = True)
df1

      age  weight  height
name
Kim    23      46     160
Lee    21      53     162
Jung   24      55     170
Choi   22      49     158
Lim    20      60     164

In [15]:
df1[['age', 'height']]

      age  height
name
Kim    23     160
Lee    21     162
Jung   24     170
Choi   22     158
Lim    20     164

In [16]:
df1['weight']['Jung'] = 45
df1

      age  weight  height
name
Kim    23      46     160
Lee    21      53     162
Jung   24      45     170
Choi   22      49     158
Lim    20      60     164

In [17]:
df1.sort_index(inplace = True)
df1

      age  weight  height
name
Choi   22      49     158
Jung   24      45     170
Kim    23      46     160
Lee    21      53     162
Lim    20      60     164

In [18]:
df1.sort_values('weight', ascending = False, inplace = True)
df1

      age  weight  height
name
Lim    20      60     164
Lee    21      53     162
Choi   22      49     158
Kim    23      46     160
Jung   24      45     170

In [19]:
df1.loc['mean'] = df1.mean()
df1

       age  weight  height
name
Lim   20.0    60.0   164.0
Lee   21.0    53.0   162.0
Choi  22.0    49.0   158.0
Kim   23.0    46.0   160.0
Jung  24.0    45.0   170.0
mean  22.0    50.6   162.8

In [20]:
type(df1.values)

numpy.ndarray

In [21]:
df1['BMI'] = (df1['weight'] / (df1['height'] / 100) ** 2).round(2)
df1

       age  weight  height    BMI
name
Lim   20.0    60.0   164.0  22.31
Lee   21.0    53.0   162.0  20.20
Choi  22.0    49.0   158.0  19.63
Kim   23.0    46.0   160.0  17.97
Jung  24.0    45.0   170.0  15.57
mean  22.0    50.6   162.8  19.09

In [22]:
import numpy as np
df1['BMI_G'] = np.where(df1['BMI'] <= 17, 'low', np.where(df1['BMI'] <= 20, 'normal', 'obesity'))
df1

       age  weight  height    BMI    BMI_G
name
Lim   20.0    60.0   164.0  22.31  obesity
Lee   21.0    53.0   162.0  20.20  obesity
Choi  22.0    49.0   158.0  19.63   normal
Kim   23.0    46.0   160.0  17.97   normal
Jung  24.0    45.0   170.0  15.57      low
mean  22.0    50.6   162.8  19.09   normal

In [23]:
df1.drop(index = ['Lim', 'Kim'], inplace = True)
df1

       age  weight  height    BMI    BMI_G
name
Lee   21.0    53.0   162.0  20.20  obesity
Choi  22.0    49.0   158.0  19.63   normal
Jung  24.0    45.0   170.0  15.57      low
mean  22.0    50.6   162.8  19.09   normal

In [24]:
df1.rename(columns = {'age': '나이'}, inplace = True)
df1

        나이  weight  height    BMI    BMI_G
name
Lee   21.0    53.0   162.0  20.20  obesity
Choi  22.0    49.0   158.0  19.63   normal
Jung  24.0    45.0   170.0  15.57      low
mean  22.0    50.6   162.8  19.09   normal

In [25]:
for index in range(len(df2.index)):
    t_sum = 0
    for column in range(len(df2.columns)):
        t_sum += df2[df2.columns[column][index]
    print(df2.index[index], ':', t_sum/len(df2.columns))

SyntaxError: invalid syntax (1265365439.py, line 5)

In [26]:
df2.loc['mean'] = df1['BMI']
df2

          Kim    Lee    Jung    Choi    Lim
age      23.0   21.0   24.00   22.00   20.0
weight   46.0   53.0   55.00   49.00   60.0
height  160.0  162.0  170.00  158.00  164.0
mean      NaN   20.2   15.57   19.63    NaN

In [27]:
df2 = df2.assign(mean = df2['Kim'] + df2['Lee'] )
df2

          Kim    Lee    Jung    Choi    Lim   mean
age      23.0   21.0   24.00   22.00   20.0   44.0
weight   46.0   53.0   55.00   49.00   60.0   99.0
height  160.0  162.0  170.00  158.00  164.0  322.0
mean      NaN   20.2   15.57   19.63    NaN    NaN

In [29]:
df2.loc['BMI_G'] = np.where(df2['BMI'] <= 17, 'low', np.where(df2['BMI'] >= 20, 'normal', 'obesity'))

KeyError: 'BMI'

In [30]:
df2.reset_index(inplace = True)